[
    {
        "title": "Proof-Carrying Numbers (PCN): A Protocol for Trustworthy Numeric Answers\n  from LLMs via Claim Verification",
        "url": "http://arxiv.org/abs/2509.06902v1",
        "pub_date": "2025-09-08",
        "summary": "Large Language Models (LLMs) as stochastic systems may generate numbers that deviate from available data, a failure known as \\emph{numeric hallucination}. Existing safeguards -- retrieval-augmented generation, citations, and uncertainty estimation -- improve transparency but cannot guarantee fidelity: fabricated or misquoted values may still be displayed as if correct. We propose \\textbf{Proof-Carrying Numbers (PCN)}, a presentation-layer protocol that enforces numeric fidelity through mechanical verification. Under PCN, numeric spans are emitted as \\emph{claim-bound tokens} tied to structured claims, and a verifier checks each token under a declared policy (e.g., exact equality, rounding, aliases, or tolerance with qualifiers). Crucially, PCN places verification in the \\emph{renderer}, not the model: only claim-checked numbers are marked as verified, and all others default to unverified. This separation prevents spoofing and guarantees fail-closed behavior. We formalize PCN and prove soundness, completeness under honest tokens, fail-closed behavior, and monotonicity under policy refinement. PCN is lightweight and model-agnostic, integrates seamlessly into existing applications, and can be extended with cryptographic commitments. By enforcing verification as a mandatory step before display, PCN establishes a simple contract for numerically sensitive settings: \\emph{trust is earned only by proof}, while the absence of a mark communicates uncertainty.",
        "translated": "大型语言模型（LLMs）作为随机性系统可能生成偏离可用数据的数值，这种错误被称为\"数值幻觉\"。现有防护机制——检索增强生成、引用和不确定性估计——虽能提升透明度，但无法保证数值保真度：虚构或误引的数值仍可能以正确形式呈现。我们提出**可验证数值载体（PCN）**，这是一种通过机械验证确保数值保真度的呈现层协议。在PCN框架下，数值片段以与结构化声明绑定的\"声明约束令牌\"形式输出，验证器根据声明策略（如精确等价、舍入规则、别名系统或带限定条件的容差范围）检查每个令牌。关键创新在于PCN将验证环节置于渲染器而非模型中：只有通过声明验证的数值会被标记为已验证，其余数值默认处于未验证状态。这种分离设计有效防止欺骗行为，并确保故障封闭特性。我们形式化定义了PCN协议，并证明其具备可靠性、诚实令牌下的完备性、故障封闭特性以及策略优化下的单调性。PCN具有轻量化和模型无关特性，可无缝集成至现有应用系统，并能通过密码学承诺进行功能扩展。通过将验证作为数值显示前的强制步骤，PCN为数值敏感场景建立了简明契约：唯有通过验证才能获得信任，而缺乏验证标识则传递不确定性信息。"
    }
]
